user = int(input("enter your age"))
if age >= 15:
    print("შენ ხარ 15 წლის შეგიძლია შემოსვლა")
if age <= 15:
    print("შენ ვერ შემოხვალ არახარ 15 წლის")




#--------------------------------------------------------------------------------------------------------------------------------------



name = int(input("enter your name"))
if name >= 8:
    print("შენი სახელი სწორია")
if name <= 8:
    print("შენი სახელი არასწორია გაიმეორე")




#-------------------------------------------------------------------------------------------------------------------------------------

age = int (input("enter your age: "))
if age >= 18:
    print("you are adult")
else:
    print("you are not adult")





#--------------------------------------------------------------------------------------------------------------------------------


passwprd = input("Enter password:  ")
