
for i in range(1, 100, 2):
    print(i)


for i in range(0, 100, 2):
    print(i)


names = ["andria", "giorgi", "nika"]



for name in names:
    print(name)

# 4) start, end, step-ის ახსნა
# start — საიდან იწყება ციკლი
# end — სადამდე მიდის (end არ შედის)
# step — რამდენით იზრდება ცვლადი ყოველ იტერაციაზე
for i in range(1, 10, 2):
    print(i)

# 5) რაში გამოგვადგება ცვლადზე გადავლა
# ცვლადზე გადავლა გამოიყენება:
# როცა გვინდა სიაში არსებული ყველა მონაცემის დამუშავება
# როცა ბევრი ელემენტია და ხელით დაწერა რთულია
# როცა ერთსა და იმავე მოქმედებას ვაკეთებთ ბევრჯერ
# მაგალითად სახელების, რიცხვების ან მონაცემების დაბეჭდვა
