#ცვლადი არის ყუთი სადაც რაღაცას ვინახავთ
#მაგ:


name = "giorgi"
age = 12









#-----------------------------------------------------------------------------------------------------------------------------------------------------------------

#სია არის როცა დაბწერთ listn და შემდეგ ფრჩხილებში რომ შევიყვანთ ნებისმიერ რამეს
#მაგ:


listn=["gio", "sandro" , "luka"]





#---------------------------------------------------------------------------------------------------------------------------------------------------------------




#input აძლევს მომხმარებელს საშვალებას რომ რაიმე შემოვატანინოთ სახელი გვარი და ა.ს.შ

#int(integer) არის ნებისმიერე მთელი რიცხვი მაგ: 5,67,999

#str(string) არის ნებისმიერი გამოსახულება რასაც ჩავსმავთ ბრჭყალებში





#--------------------------------------------------------------------------------------------------------------------------------------------------------------


#if  არის რაღაც კოდს რომ დავწერთ და რომ გვინდა რომ გავაგრძელოთ

#else და elis არის როდესაც რაღაცა კოდის 