temperature=23
if temperature >= 23:
    print("ხვალ იქნბეა სიცხე მოკლე კლაბევს ჩავიცმევ")
else:
    print("ხვალ იქნება სიგრილე ჩავიცმევ თბილად")



#-----------------------------------------------------------------------------------------------

age=11
age1=11
if age == age1: 
    print("ჩვენ ტოლები ვართ")
else:
    print("ჩვენ არ ვართ ტოლები")



#-------------------------------------------------------------------------------------------------

age=0
age1=-1
if age <= age1:
    print("მე ვარ მაგაზე ც")


elif age == age1:
    print("ჩვენ ტოლები ვართ")

elif age <= age1:
    print("მე ვარ მაგაზე პატარა")


elif age or age1:
    print("ესეთი რამე არ არსებობს")